stocks.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-12-19 Sun 16:21 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Building the STOCKS Application</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Sean Gallagher">
<link
    href="https://cdn.simplecss.org/simple.min.css"
    rel="stylesheet"
    type="text/css"
/>
<link
    href="/styles/styles.css"
    rel="stylesheet"
    type="text/css"
/>
</head>
<body>
<header id="header" class="status">
<h1>Sean Gallagher</h1>
<nav>
  <a href="/">Home</a>
  <a href="/stocks.html">The STOCKS Application</a>
  <a href="/build.html">How it's Made</a>
</nav>
</header>
<main id="content">

<div id="outline-container-orgf38b127" class="outline-2">
<h2 id="orgf38b127">Building the STOCKS Application</h2>
<div class="outline-text-2" id="text-orgf38b127">
<p>
The process of building the STOCKS application began in 2020,
    with the development of the original server application.
This application,
    written in Javascript for the Node.js platform,
    presented a fairly conventional REST API
    for accessing a MongoDB backend.
Its successor,
    a full-stack application using modern Typescript
    and popular front- and back-end frameworks,
    is the product of nearly a month of concerted effort.
The video code review and narratives below
    discuss the state of the original project
    and the development process that led to the STOCKS application.
</p>
</div>
<div id="outline-container-org41fbf76" class="outline-3">
<h3 id="org41fbf76"><a href="posts/code-review.html">Video Code Review</a></h3>
<div class="outline-text-3" id="text-org41fbf76">
<p>
The Video Code Review focuses on the state of the original Javascript server,
    as it existed at the end of August, 2020.
</p>
</div>
</div>
<div id="outline-container-org613b1ca" class="outline-3">
<h3 id="org613b1ca"><a href="posts/stocks-server.html">Rewriting the STOCKS Server</a></h3>
<div class="outline-text-3" id="text-org613b1ca">
<p>
The first step in building the new STOCKS application
    was to tackle reimplementing the server in Typescript.
This meant wholesale embrace of new techniques and tools
    and a more nuanced approach to data.
</p>
</div>
</div>
</div>
</main>
<footer id="footer" class="status">
<p>&copy;&thinsp;2021 Sean Gallagher<br><a href="mailto:seangllghr@gmail.com">seangllghr@gmail.com</a></p>
</footer>
</body>
</html>
